<table align="left" width=100%>
    <tr>
        <td width="12%">
            <img src="../images/RA_Logo.png">
        </td>
        <td>
            <div align="center">
                <font color="#21618C" size=8px>
                    <b>Advanced Python Programming <br> (Day 2) </b>
                    </b>
                </font>
            </div>
        </td>
    </tr>
</table>

<table align="left">
  <td>
    <a href="https://colab.research.google.com/github/vidyadharbendre/learn_advanced_python_using_examples/blob/main/notebooks/Advanced/advanced_python_programming_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>
  </td>
  <td>
    <a target="_blank" href="https://kaggle.com/kernels/welcome?src=https://github.com/vidyadharbendre/learn_advanced_python_using_examples/blob/main/notebooks/Advanced/advanced_python_programming_2.ipynb"><img src="https://kaggle.com/static/images/open-in-kaggle.svg" /></a>
  </td>
</table>

In [1]:
!pip show pandas

Name: pandas
Version: 1.4.3
Summary: Powerful data structures for data analysis, time series, and statistics
Home-page: https://pandas.pydata.org
Author: The Pandas Development Team
Author-email: pandas-dev@python.org
License: BSD-3-Clause
Location: /Users/vidyadharbendre/miniforge3/lib/python3.9/site-packages
Requires: numpy, python-dateutil, pytz
Required-by: fitz, linear-regression, seaborn, stable-baselines3, statsmodels

In [2]:
#!conda install pandas
# or
#!pip install pandas

## Table of Content.
1. **[Data Structures with Examples](#Data_Structures)**
2. **[Create and Manipulate the Data Frames](#create_manipulate)**
3. **[Sorting](#sorting)**
4. **[Ranking](#ranking)**

### Let's begin with some hands-on practice exercises.

<a id='Data_Structures'></a>
## 1. Data Structures with Examples

<table align="left">
    <tr>
        <td width="6%">
            <img src="../images/RA_Logo.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>1. Write a program to convert given array to an ordinary list with the same items
<b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the below array:**<br>
array1 = array('b', [21,23,63,74])

In [3]:
# write your code here
from array import array

array1 = array('b', [21,23,63,74])

ord_list = array1.tolist()
print(ord_list)

[21, 23, 63, 74]

<table align="left">
    <tr>
        <td width="6%">
            <img src="../images/RA_Logo.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>2. Extract second word from the given string
<b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the below string:**<br>
string = 'Be confident and be yourself'

In [4]:
# write your code here

string = 'Wholehearted EFFORT yields the best results'

a = string.split()

second_word = a[1]

# Print the second word
print(f'The second word in the given sentence is.......: {second_word}')

The second word in the given sentence is.......: EFFORT

<a id='create_manipulate'></a>
## 2. Create and Manipulate the Data Frames

<table align="left">
    <tr>
        <td width="6%">
            <img src="../images/RA_Logo.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>3. Split a 'Name' column into two seperate columns <b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the below data frame:**<br>
df = pd.DataFrame({'Name': ['Vidyadhar Bendre', 'Akshara Bendre', 'Atharva Bendre', 'Poornima Bendre'],<br> 
                   'Salary':[3200, 4500, 3600, 5596]})

In [5]:
# write your code here
import pandas as pd

In [6]:
pd.DataFrame()

Empty DataFrame
Columns: []
Index: []

In [7]:
pd.DataFrame({'Name': ['Vidyadhar Bendre', 'Akshara Bendre', 'Atharva Bendre', 'Poornima Bendre'],
'Salary':[3200, 4500, 3600, 5596]})

               Name  Salary
0  Vidyadhar Bendre    3200
1    Akshara Bendre    4500
2    Atharva Bendre    3600
3   Poornima Bendre    5596

In [8]:
df = pd.DataFrame({'Name': ['Vidyadhar Bendre', 'Akshara Bendre', 'Atharva Bendre', 'Poornima Bendre', 'Shashikanth Bendre', 'Meena Bendre', 'Vivek Bendre', 'Veena Bendre', 'Vijay Bendre'],
'Salary':[3200, 4500, 3600, 5596, 6785, 6754, 7865, 1234, 8907]})

In [9]:
df.columns

Index(['Name', 'Salary'], dtype='object')

In [10]:
df.head()

                 Name  Salary
0    Vidyadhar Bendre    3200
1      Akshara Bendre    4500
2      Atharva Bendre    3600
3     Poornima Bendre    5596
4  Shashikanth Bendre    6785

In [11]:
df.tail()

                 Name  Salary
4  Shashikanth Bendre    6785
5        Meena Bendre    6754
6        Vivek Bendre    7865
7        Veena Bendre    1234
8        Vijay Bendre    8907

In [12]:




df[['First','Last']] = df.Name.str.split(expand=True)
df




#df['Name'] = df['Name'].str.split(' ')


#split_name = df['Name'].str.split(' ')
#data = split_name.to_list()
#names = ['First Name', 'Last Name']
#new_df = pd.DataFrame(data, columns=names)
#new_df

                 Name  Salary        First    Last
0    Vidyadhar Bendre    3200    Vidyadhar  Bendre
1      Akshara Bendre    4500      Akshara  Bendre
2      Atharva Bendre    3600      Atharva  Bendre
3     Poornima Bendre    5596     Poornima  Bendre
4  Shashikanth Bendre    6785  Shashikanth  Bendre
5        Meena Bendre    6754        Meena  Bendre
6        Vivek Bendre    7865        Vivek  Bendre
7        Veena Bendre    1234        Veena  Bendre
8        Vijay Bendre    8907        Vijay  Bendre

<table align="left">
    <tr>
        <td width="6%">
            <img src="../images/RA_Logo.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>4. Select the rows from below data frame, whose marks is less than 60 <b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the below data frame:**<br>
df_student = pd.DataFrame({'Name': ['Vidyadhar', 'Poornima', 'Atharva', 'Akshara'],<br>
                           'Marks': [90, 50, 89, 55]<br>
})

In [13]:
# write your code here
import pandas as pd

In [14]:
pd.DataFrame({'Name': ['Vidyadhar', 'Poornima', 'Atharva', 'Akshara'],
'Marks': [90, 50, 89, 55]
})

        Name  Marks
0  Vidyadhar     90
1   Poornima     50
2    Atharva     89
3    Akshara     55

In [15]:
df_student = pd.DataFrame({'Name': ['Vidyadhar', 'Poornima', 'Atharva', 'Akshara'],
'Marks': [90, 50, 89, 55]
})

In [16]:
df_student[df_student.Marks >= 90]

        Name  Marks
0  Vidyadhar     90

In [17]:
df_student.Marks.mean()

71.0

<table align="left">
    <tr>
        <td width="6%">
            <img src="../images/RA_Logo.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>5. Write a program to select the rows, where the sales are greater than 60000 for Mumbai location <b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the below dataframe:**<br>
df_store = pd.DataFrame({'Store': ['A', 'B', 'A', 'C', 'D', 'A', 'D', 'A', 'C', 'B'],<br>
                         'Location': ['Mumbai', 'Pune', 'Hyderabad', 'Mumbai', 'Pune', 'Delhi', 'Hyderabad', 'Pune',<br>
                         'Mumbai', 'Pune'],<br>
                         'Sales': [40000, 45600, 56000, 90000, 89000, 87000, 85000, 78000, 89000, 70000]<br>
})

In [18]:
# write your code here

df_store = pd.DataFrame({'Store': ['A', 'B', 'A', 'C', 'D', 'A', 'D', 'A', 'C', 'B'],
'Location': ['Mumbai', 'Pune', 'Hyderabad', 'Mumbai', 'Pune', 'Delhi', 'Hyderabad', 'Pune',
'Mumbai', 'Pune'],
'Sales': [40000, 45600, 56000, 90000, 89000, 87000, 85000, 78000, 89000, 70000]
})

df_store[ (df_store.Sales > 60000) &  (df_store.Location == 'Mumbai')]

  Store Location  Sales
3     C   Mumbai  90000
8     C   Mumbai  89000

In [19]:
!ls -la

total 3720
drwxr-xr-x  15 vidyadharbendre  staff     480 Jul  3 23:02 .
drwxr-xr-x   8 vidyadharbendre  staff     256 May 28 07:26 ..
-rw-r--r--@  1 vidyadharbendre  staff    8196 Jul  2 21:08 .DS_Store
drwxr-xr-x  10 vidyadharbendre  staff     320 Jun 25 15:03 .ipynb_checkpoints
-rw-r--r--@  1 vidyadharbendre  staff  237793 May 19 09:17 1600px-Sunflower_from_Silesia2.jpg
-rw-r--r--@  1 vidyadharbendre  staff   24859 Jul  3 23:02 Additional_Examples.ipynb
drwxr-xr-x   4 vidyadharbendre  staff     128 Jul  2 11:00 LeetCode_Examples
-rw-rw-r--@  1 vidyadharbendre  staff     377 Jan  6  2020 Supermarket.csv
-rw-------@  1 vidyadharbendre  staff   56415 Jun  6 08:17 advanced_python_programming_1.ipynb
-rw-------@  1 vidyadharbendre  staff   76665 Jun 25 15:11 advanced_python_programming_2.ipynb
-rw-------@  1 vidyadharbendre  staff  141810 Jun 19 20:47 advanced_python_programming_3.ipynb
-rw-------@  1 vidyadharbendre  staff  837842 Jun 19 21:41 advanced_python_programming_4.ipynb
-rw-r--r--   1 vidyadharbendre  staff     189 May  8 23:37 df_store.csv
-rw-r--r--@  1 vidyadharbendre  staff  128888 Jun  4 20:44 gradient_descent.ipynb
-rw-r--r--@  1 vidyadharbendre  staff  362494 Jun  4 20:43 numpy_edge_detection.ipynb

In [23]:
import pandas as pd

In [24]:
!pwd

/Users/vidyadharbendre/workspace/advanced_python/learn_advanced_python_using_examples/notebooks/Advanced

In [25]:
!ls -la df*

-rw-r--r--  1 vidyadharbendre  staff  189 May  8 23:37 df_store.csv

In [ ]:
pd.rea

In [39]:
df_store = pd.read_csv('df_store.csv')

In [40]:
df_store.head()

   Unnamed: 0 Store   Location  Sales
0           0     A     Mumbai  40000
1           1     B       Pune  45600
2           2     A  Hyderabad  56000
3           3     C     Mumbai  90000
4           4     D       Pune  89000

In [29]:
df_store.tail()

   Unnamed: 0 Store   Location  Sales
5           5     A      Delhi  87000
6           6     D  Hyderabad  85000
7           7     A       Pune  78000
8           8     C     Mumbai  89000
9           9     B       Pune  70000

In [20]:
df_store = pd.read_csv('df_store.csv')

In [21]:
df_store.columns

Index(['Unnamed: 0', 'Store', 'Location', 'Sales'], dtype='object')

In [22]:
df_store.head()

   Unnamed: 0 Store   Location  Sales
0           0     A     Mumbai  40000
1           1     B       Pune  45600
2           2     A  Hyderabad  56000
3           3     C     Mumbai  90000
4           4     D       Pune  89000

In [30]:
df_store.tail()

   Unnamed: 0 Store   Location  Sales
5           5     A      Delhi  87000
6           6     D  Hyderabad  85000
7           7     A       Pune  78000
8           8     C     Mumbai  89000
9           9     B       Pune  70000

In [32]:
df_store.shape

(10, 4)

In [33]:
df_store.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  10 non-null     int64
 1   Store       10 non-null     object
 2   Location    10 non-null     object
 3   Sales       10 non-null     int64
dtypes: int64(2), object(2)
memory usage: 448.0+ bytes

In [34]:
df_store.describe()

       Unnamed: 0         Sales
count    10.00000     10.000000
mean      4.50000  72960.000000
std       3.02765  19159.401522
min       0.00000  40000.000000
25%       2.25000  59500.000000
50%       4.50000  81500.000000
75%       6.75000  88500.000000
max       9.00000  90000.000000

In [35]:
df_store.columns

Index(['Unnamed: 0', 'Store', 'Location', 'Sales'], dtype='object')

In [36]:
df_store.drop(columns=['Unnamed: 0'], axis=1)

  Store   Location  Sales
0     A     Mumbai  40000
1     B       Pune  45600
2     A  Hyderabad  56000
3     C     Mumbai  90000
4     D       Pune  89000
5     A      Delhi  87000
6     D  Hyderabad  85000
7     A       Pune  78000
8     C     Mumbai  89000
9     B       Pune  70000

In [37]:
df_store = df_store.drop(columns=['Unnamed: 0'], axis=1)

In [38]:
df_store.columns

Index(['Store', 'Location', 'Sales'], dtype='object')

In [41]:
df_store.columns

Index(['Unnamed: 0', 'Store', 'Location', 'Sales'], dtype='object')

In [43]:
df_store.drop(columns=['Unnamed: 0'], axis=1, inplace=True)

In [44]:
df_store.columns

Index(['Store', 'Location', 'Sales'], dtype='object')

<table align="left">
    <tr>
        <td width="6%">
            <img src="../images/RA_Logo.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>6. Write a program to display a summary of the basic information about a given data frame<b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the below dataframe:**<br>
df_store = pd.DataFrame({'Store': ['A', 'B', 'A', 'C', 'D', 'A', 'D', 'A', 'C', 'B'],<br>
                         'Location': ['Mumbai', 'Pune', 'Hyderabad', 'Mumbai', 'Pune', 'Delhi', 'Hyderabad', 'Pune',<br>
                         'Mumbai', 'Pune'],<br>
                         'Sales': [40000, 45600, 56000, 90000, 89000, 87000, 85000, 78000, 89000, 70000]<br>
})

In [6]:
# write your code here

df_store = pd.DataFrame({'Store': ['A', 'B', 'A', 'C', 'D', 'A', 'D', 'A', 'C', 'B'],
'Location': ['Mumbai', 'Pune', 'Hyderabad', 'Mumbai', 'Pune', 'Delhi', 'Hyderabad', 'Pune',
'Mumbai', 'Pune'],
'Sales': [40000, 45600, 56000, 90000, 89000, 87000, 85000, 78000, 89000, 70000]
})


#d = df_store.describe(include='all')
#print(d)
#print(type(d))

i = df_store.info()
print(i)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Store     10 non-null     object
 1   Location  10 non-null     object
 2   Sales     10 non-null     int64
dtypes: int64(1), object(2)
memory usage: 368.0+ bytes
None

<table align="left">
    <tr>
        <td width="6%">
            <img src="../images/RA_Logo.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>7. Write a program to replace the Store' column, contains the values 'A', 'B', 'C', and 'D' with 'Store_A', Store_B', 'Store_C' and 'Store_D' respectively
<b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the below dataframe:**<br>
df_store = pd.DataFrame({'Store': ['A', 'B', 'A', 'C', 'D', 'A', 'D', 'A', 'C', 'B'],<br>
                         'Location': ['Mumbai', 'Pune', 'Hyderabad', 'Mumbai', 'Pune', 'Delhi', 'Hyderabad', 'Pune',<br>
                         'Mumbai', 'Pune'],<br>
                         'Sales': [40000, 45600, 56000, 90000, 89000, 87000, 85000, 78000, 89000, 70000]<br>
})

In [7]:
# write your code here
import numpy as np

df_store = pd.DataFrame({'Store': ['A', 'B', 'A', 'C', 'D', 'A', 'D', 'A', 'C', 'B'],
'Location': ['Mumbai', 'Pune', 'Hyderabad', 'Mumbai', 'Pune', 'Delhi', 'Hyderabad', 'Pune',
'Mumbai', 'Pune'],
'Sales': [40000, 45600, 56000, 90000, 89000, 87000, 85000, 78000, 89000, 70000]
})

df_store['Store'] = df_store['Store'].replace(['A', 'B', 'C', 'D'],['Store_A', 'Store_B', 'Store_C', 'Store_D'])

print(df_store)

     Store   Location  Sales
0  Store_A     Mumbai  40000
1  Store_B       Pune  45600
2  Store_A  Hyderabad  56000
3  Store_C     Mumbai  90000
4  Store_D       Pune  89000
5  Store_A      Delhi  87000
6  Store_D  Hyderabad  85000
7  Store_A       Pune  78000
8  Store_C     Mumbai  89000
9  Store_B       Pune  70000

<table align="left">
    <tr>
        <td width="6%">
            <img src="../images/RA_Logo.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>8. Create a dataframe in pandas using list and series
<b>
                </font>
            </div>
        </td>
    </tr>
</table>

In [8]:
# write your code here

countries_name = ['India', 'US', 'UK', 'Australia']    
countries_id = [1, 2, 3, 4] 

df_countries = pd.DataFrame (list(zip(countries_name, countries_id)),
               columns =['Name Of the Country', 'Country Id'])

df_countries


mylist1 = [[10,100,1000],[20,200,2000],[30,300,3000],[40,400,4000],[50,500,5000]]
row_label_list = ['Tata','Birla','Tata','Infy','HCL']
col_label_list = ['Vol','Rev', 'Exp']

df2 = pd.DataFrame(mylist1, columns=col_label_list, index=row_label_list)
print(df2)
print(df2.shape)
print(df2.index)
print(df2.columns)

       Vol  Rev   Exp
Tata    10  100  1000
Birla   20  200  2000
Tata    30  300  3000
Infy    40  400  4000
HCL     50  500  5000
(5, 3)
Index(['Tata', 'Birla', 'Tata', 'Infy', 'HCL'], dtype='object')
Index(['Vol', 'Rev', 'Exp'], dtype='object')

<table align="left">
    <tr>
        <td width="6%">
            <img src="../images/RA_Logo.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>9. Save a given dataframe to a csv file
<b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the below dataframe:**<br>
df_store = pd.DataFrame({'Store': ['A', 'B', 'A', 'C', 'D', 'A', 'D', 'A', 'C', 'B'],<br>
                         'Location': ['Mumbai', 'Pune', 'Hyderabad', 'Mumbai', 'Pune', 'Delhi', 'Hyderabad', 'Pune',<br>
                         'Mumbai', 'Pune'],<br>
                         'Sales': [40000, 45600, 56000, 90000, 89000, 87000, 85000, 78000, 89000, 70000]<br>
})

In [9]:
# write your code here

df_store = pd.DataFrame({'Store': ['A', 'B', 'A', 'C', 'D', 'A', 'D', 'A', 'C', 'B'],
'Location': ['Mumbai', 'Pune', 'Hyderabad', 'Mumbai', 'Pune', 'Delhi', 'Hyderabad', 'Pune',
'Mumbai', 'Pune'],
'Sales': [40000, 45600, 56000, 90000, 89000, 87000, 85000, 78000, 89000, 70000]
})

# saving the dataframe 
df_store.to_csv('df_store.csv') 
import os
os.getcwd()

'/Users/vidyadharbendre/workspace/advanced_python/learn_advanced_python_using_examples/notebooks/Advanced'

<table align="left">
    <tr>
        <td width="6%">
            <img src="../images/RA_Logo.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>10. Find the maximum sales for each store
<b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the below dataframe:**<br>
df_store = pd.DataFrame({'Store': ['A', 'B', 'A', 'C', 'D', 'A', 'D', 'A', 'C', 'B'],<br>
                         'Location': ['Mumbai', 'Pune', 'Hyderabad', 'Mumbai', 'Pune', 'Delhi', 'Hyderabad', 'Pune',<br>
                         'Mumbai', 'Pune'],<br>
                         'Sales': [40000, 45600, 56000, 90000, 89000, 87000, 85000, 78000, 89000, 70000]<br>
})

In [12]:
# write your code here

df_store = pd.DataFrame({'Store': ['A', 'B', 'A', 'C', 'D', 'A', 'D', 'A', 'C', 'B'],
'Location': ['Mumbai', 'Pune', 'Hyderabad', 'Mumbai', 'Pune', 'Delhi', 'Hyderabad', 'Pune',
'Mumbai', 'Pune'],
'Sales': [40000, 45600, 56000, 90000, 89000, 87000, 85000, 78000, 89000, 70000]
})
print(df_store)
#DataFrame.min(axis=None, skipna=None, level=None, numeric_only=None, **kwargs)

df_store_group = df_store.groupby('Store')
print(df_store_group.max())

  Store   Location  Sales
0     A     Mumbai  40000
1     B       Pune  45600
2     A  Hyderabad  56000
3     C     Mumbai  90000
4     D       Pune  89000
5     A      Delhi  87000
6     D  Hyderabad  85000
7     A       Pune  78000
8     C     Mumbai  89000
9     B       Pune  70000
      Location  Sales
Store
A         Pune  87000
B         Pune  70000
C       Mumbai  90000
D         Pune  89000

<table align="left">
    <tr>
        <td width="6%">
            <img src="../images/RA_Logo.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>11. Write a program to select all columns, except 'Ranking_Rate' column in a data frame
<b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the below dataframe:**<br>
df_store = pd.DataFrame({'Store': ['A', 'B', 'A', 'C', 'D', 'A', 'D', 'A', 'C', 'B'],<br>
                         'Location': ['Mumbai', 'Pune', 'Hyderabad', 'Mumbai', 'Pune', 'Delhi', 'Hyderabad', 'Pune',<br>
                         'Mumbai', 'Pune'],<br>
                         'Sales': [40000, 45600, 56000, 90000, 89000, 87000, 85000, 78000, 89000, 70000]<br>
})

In [15]:
# write your code here

df_store = pd.DataFrame({'Store': ['A', 'B', 'A', 'C', 'D', 'A', 'D', 'A', 'C', 'B'],
'Location': ['Mumbai', 'Pune', 'Hyderabad', 'Mumbai', 'Pune', 'Delhi', 'Hyderabad', 'Pune',
'Mumbai', 'Pune'],
'Sales': [40000, 45600, 56000, 90000, 89000, 87000, 85000, 78000, 89000, 70000]
})


df_store['Rating_Rank'] = df_store['Sales'].rank(ascending = 0)  
#print(df_store)
#print(df_store[['Store', 'Location', 'Sales']])
print(df_store.iloc[:,0:3])

  Store   Location  Sales
0     A     Mumbai  40000
1     B       Pune  45600
2     A  Hyderabad  56000
3     C     Mumbai  90000
4     D       Pune  89000
5     A      Delhi  87000
6     D  Hyderabad  85000
7     A       Pune  78000
8     C     Mumbai  89000
9     B       Pune  70000

<table align="left">
    <tr>
        <td width="6%">
            <img src="../images/RA_Logo.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>12. Write a program to insert a given column at a specific column index in a data frame
<b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the below data frame**<br>
data = {'Name': ['Emma Larter', 'Mia Junior', 'Sophia Depp', 'James Smith'], 'Age': [34, 59, 32, 40]}<br>
df = pd.DataFrame(data=data)<br><br>
**Add the new variable salary as third column**<br>
salary = [35000, 24000, 55000, 40000]

In [16]:
# write your code here

data = {'Name': ['Emma Larter', 'Mia Junior', 'Sophia Depp', 'James Smith'], 'Age': [34, 59, 32, 40]}
df = pd.DataFrame(data=data)

salary = [35000, 24000, 55000, 40000]

df['salary'] = salary
print(df)

          Name  Age  salary
0  Emma Larter   34   35000
1   Mia Junior   59   24000
2  Sophia Depp   32   55000
3  James Smith   40   40000

<table align="left">
    <tr>
        <td width="6%">
            <img src="../images/RA_Logo.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>13. Write a program to get the third row of a given data frame
<b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the below data frame**<br>
data = {'Name': ['Emma Larter', 'Mia Junior', 'Sophia Depp', 'James Smith'], 'Age': [34, 59, 32, 40]}<br>
df = pd.DataFrame(data=data)<br><br>

In [302]:
# write your code here

data = {'Name': ['Emma Larter', 'Mia Junior', 'Sophia Depp', 'James Smith'], 'Age': [34, 59, 32, 40]}
df = pd.DataFrame(data=data)
print(df)


df.iloc[[2]]

          Name  Age
0  Emma Larter   34
1   Mia Junior   59
2  Sophia Depp   32
3  James Smith   40

          Name  Age
2  Sophia Depp   32

<table align="left">
    <tr>
        <td width="6%">
            <img src="../images/RA_Logo.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>14. Write a program to create a data frame from a numpy array
<b>
                </font>
            </div>
        </td>
    </tr>
</table>

In [17]:
# write your code here
import pandas as pd
import numpy as np

np.random.seed(23)
n53 = np.random.randint(low=10, high=100,size=(5,3))

row_label_list = ['Tata','Birla','Tata','Infy','HCL']
col_label_list = ['Vol','Rev', 'Exp']

df2 = pd.DataFrame(n53, index=row_label_list, columns=col_label_list)

print(df2)
print(df2.shape)
print(df2.index)
print(df2.columns)

       Vol  Rev  Exp
Tata    93   50   83
Birla   64   41   86
Tata    49   35   61
Infy    16   55   22
HCL     59   76   85
(5, 3)
Index(['Tata', 'Birla', 'Tata', 'Infy', 'HCL'], dtype='object')
Index(['Vol', 'Rev', 'Exp'], dtype='object')

<table align="left">
    <tr>
        <td width="6%">
            <img src="../images/RA_Logo.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>15. Write a programm to count total sales per store
<b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the below dataframe:**<br>
df_store = pd.DataFrame({'Store': ['A', 'B', 'A', 'C', 'D', 'A', 'D', 'A', 'C', 'B'],<br>
                         'Location': ['Mumbai', 'Pune', 'Hyderabad', 'Mumbai', 'Pune', 'Delhi', 'Hyderabad', 'Pune',<br>
                         'Mumbai', 'Pune'],<br>
                         'Sales': [40000, 45600, 56000, 90000, 89000, 87000, 85000, 78000, 89000, 70000]<br>
})

In [18]:
# write your code here

df_store = pd.DataFrame({'Store': ['A', 'B', 'A', 'C', 'D', 'A', 'D', 'A', 'C', 'B'],
'Location': ['Mumbai', 'Pune', 'Hyderabad', 'Mumbai', 'Pune', 'Delhi', 'Hyderabad', 'Pune',
'Mumbai', 'Pune'],
'Sales': [40000, 45600, 56000, 90000, 89000, 87000, 85000, 78000, 89000, 70000]
})

print(df_store)
df_store_group = df_store.groupby('Store')
print(df_store_group.sum())

  Store   Location  Sales
0     A     Mumbai  40000
1     B       Pune  45600
2     A  Hyderabad  56000
3     C     Mumbai  90000
4     D       Pune  89000
5     A      Delhi  87000
6     D  Hyderabad  85000
7     A       Pune  78000
8     C     Mumbai  89000
9     B       Pune  70000
        Sales
Store
A      261000
B      115600
C      179000
D      174000

<table align="left">
    <tr>
        <td width="6%">
            <img src="../images/RA_Logo.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>16. Write a program to count the most common words in a list
<b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the below list:**<br>
words_list = ['words', 'will', 'where', 'shall', 'we', 'will', 'shall', 'we', 'words', 'where', 'shall'<br>
        'will', 'there', 'wow', 'should', 'shall', 'we', 'where', 'should', 'where', 'will', 'there',<br>
        'now', 'where', 'we', 'will', 'where', 'should', 'will', 'where']

In [19]:
# write your code here

words_list = ['words', 'will', 'where', 'shall', 'we', 'will', 'shall', 'we', 'words', 'where', 'shall'
'will', 'there', 'wow', 'should', 'shall', 'we', 'where', 'should', 'where', 'will', 'there',
'now', 'where', 'we', 'will', 'where', 'should', 'will', 'where']

keys = set(words_list)

keys_list = list(keys)
print(keys_list)

df = pd.DataFrame(data=words_list, columns=['words_list'])
count_list = df['words_list'].value_counts()

print(type(count_list))


df1 = pd.DataFrame(data = count_list)
df1.index
df1.values
df1.columns
df1.shape

print(df1)
print(df1.idxmax())



#def most_frequent(List):
#    return max(set(List), key = List.count)

#count = most_frequent(words_list)

#print(count)

['shallwill', 'there', 'words', 'will', 'where', 'should', 'now', 'shall', 'we', 'wow']
<class 'pandas.core.series.Series'>
           words_list
where               7
will                5
we                  4
shall               3
should              3
words               2
there               2
shallwill           1
wow                 1
now                 1
words_list    where
dtype: object

<a id='sorting'></a>
## 3. Sorting

<table align="left">
    <tr>
        <td width="6%">
            <img src="../images/RA_Logo.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>17. Write a program to sort the data frame by 'Sales' in ascending order
<b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the below dataframe:**<br>
df_store = pd.DataFrame({'Store': ['A', 'B', 'A', 'C', 'D', 'A', 'D', 'A', 'C', 'B'],<br>
                         'Location': ['Mumbai', 'Pune', 'Hyderabad', 'Mumbai', 'Pune', 'Delhi', 'Hyderabad', 'Pune',<br>
                         'Mumbai', 'Pune'],<br>
                         'Sales': [40000, 45600, 56000, 90000, 89000, 87000, 85000, 78000, 89000, 70000]<br>
})

In [20]:
# write your code here

df_store = pd.DataFrame({'Store': ['A', 'B', 'A', 'C', 'D', 'A', 'D', 'A', 'C', 'B'],
'Location': ['Mumbai', 'Pune', 'Hyderabad', 'Mumbai', 'Pune', 'Delhi', 'Hyderabad', 'Pune',
'Mumbai', 'Pune'],
'Sales': [40000, 45600, 56000, 90000, 89000, 87000, 85000, 78000, 89000, 70000]
})

print(df_store.sort_values(by='Sales'))

  Store   Location  Sales
0     A     Mumbai  40000
1     B       Pune  45600
2     A  Hyderabad  56000
9     B       Pune  70000
7     A       Pune  78000
6     D  Hyderabad  85000
5     A      Delhi  87000
4     D       Pune  89000
8     C     Mumbai  89000
3     C     Mumbai  90000

<table align="left">
    <tr>
        <td width="6%">
            <img src="../images/RA_Logo.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>18. Write a program to sort the data frame, first by 'Store' in ascending order, then by 'Sales' in descending order
<b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the below dataframe:**<br>
df_store = pd.DataFrame({'Store': ['A', 'B', 'A', 'C', 'D', 'A', 'D', 'A', 'C', 'B'],<br>
                         'Location': ['Mumbai', 'Pune', 'Hyderabad', 'Mumbai', 'Pune', 'Delhi', 'Hyderabad', 'Pune',<br>
                         'Mumbai', 'Pune'],<br>
                         'Sales': [40000, 45600, 56000, 90000, 89000, 87000, 85000, 78000, 89000, 70000]<br>
})

In [21]:
# write your code here
df_store = pd.DataFrame({'Store': ['A', 'B', 'A', 'C', 'D', 'A', 'D', 'A', 'C', 'B'],
'Location': ['Mumbai', 'Pune', 'Hyderabad', 'Mumbai', 'Pune', 'Delhi', 'Hyderabad', 'Pune',
'Mumbai', 'Pune'],
'Sales': [40000, 45600, 56000, 90000, 89000, 87000, 85000, 78000, 89000, 70000]
})
df_store.sort_values(by=['Store','Sales'], ascending = (True, False))

  Store   Location  Sales
5     A      Delhi  87000
7     A       Pune  78000
2     A  Hyderabad  56000
0     A     Mumbai  40000
9     B       Pune  70000
1     B       Pune  45600
3     C     Mumbai  90000
8     C     Mumbai  89000
4     D       Pune  89000
6     D  Hyderabad  85000

<a id='ranking'></a>
## 4. Ranking

<table align="left">
    <tr>
        <td width="6%">
            <img src="../images/RA_Logo.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>19. Create a column Rating_Rank, which contains the rank of each store based on sales of the product in ascending order
<b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the below dataframe:**<br>
df_store = pd.DataFrame({'Store': ['A', 'B', 'A', 'C', 'D', 'A', 'D', 'A', 'C', 'B'],<br>
                         'Location': ['Mumbai', 'Pune', 'Hyderabad', 'Mumbai', 'Pune', 'Delhi', 'Hyderabad', 'Pune',<br>
                         'Mumbai', 'Pune'],<br>
                         'Sales': [40000, 45600, 56000, 90000, 89000, 87000, 85000, 78000, 89000, 70000]<br>
})

In [22]:
# write your code here

df_store = pd.DataFrame({'Store': ['A', 'B', 'A', 'C', 'D', 'A', 'D', 'A', 'C', 'B'],
'Location': ['Mumbai', 'Pune', 'Hyderabad', 'Mumbai', 'Pune', 'Delhi', 'Hyderabad', 'Pune',
'Mumbai', 'Pune'],
'Sales': [40000, 45600, 56000, 90000, 89000, 87000, 85000, 78000, 89000, 70000]
})

df_store['Rating_Rank'] = df_store['Sales'].rank(ascending = 0)
  
print(df_store)

df_store

  Store   Location  Sales  Rating_Rank
0     A     Mumbai  40000         10.0
1     B       Pune  45600          9.0
2     A  Hyderabad  56000          8.0
3     C     Mumbai  90000          1.0
4     D       Pune  89000          2.5
5     A      Delhi  87000          4.0
6     D  Hyderabad  85000          5.0
7     A       Pune  78000          6.0
8     C     Mumbai  89000          2.5
9     B       Pune  70000          7.0

  Store   Location  Sales  Rating_Rank
0     A     Mumbai  40000         10.0
1     B       Pune  45600          9.0
2     A  Hyderabad  56000          8.0
3     C     Mumbai  90000          1.0
4     D       Pune  89000          2.5
5     A      Delhi  87000          4.0
6     D  Hyderabad  85000          5.0
7     A       Pune  78000          6.0
8     C     Mumbai  89000          2.5
9     B       Pune  70000          7.0

<table align="left">
    <tr>
        <td width="6%">
            <img src="../images/RA_Logo.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>20. Rank the data frame in descending order of sales by store
<b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the 'df_store' data frame**

In [25]:
# write your code here

df_store['Rating_Rank'] = df_store['Sales'].rank(ascending = 0)
df_store.sort_values(by=['Sales'], ascending = (False))

  Store   Location  Sales  Rating_Rank
3     C     Mumbai  90000          1.0
4     D       Pune  89000          2.5
8     C     Mumbai  89000          2.5
5     A      Delhi  87000          4.0
6     D  Hyderabad  85000          5.0
7     A       Pune  78000          6.0
9     B       Pune  70000          7.0
2     A  Hyderabad  56000          8.0
1     B       Pune  45600          9.0
0     A     Mumbai  40000         10.0

In [2]:
import sklearn
print(sklearn.__version__)

1.4.2